#include <iostream>
#include <Windows.h>

using namespace std;

void Translate(int day, int month)
{
    string mon[12] = {"січня", "лютого", "березня", "квітня", "травня",\
       "червня", "липня", "серпня", "вересня", "жовтня", "листопада", "грудня"};
    string dat[31] = {" Перше ", " Друге ", " Третє ", " Четверте ",\
        " П'яте ", " Шосте ", " Сьоме ", " Восьме ", " Дев'те ", " Десяте ", " Одинадцяте ",\
        " Дванадцяте ", " Тринадцяте ", " Чотринадцяте ", " П'ятнадцяте ",\
        " Шістнадцяте ", " Сімнадцяте ", " Вісімнадцяте ", " Дев'ятнадцяте ",\
        " Двадцяте ", " Двадцять перше ", " Двадцять друге ", " Двадцять третє ",\
        " Двадцять четверте ", " Двадцять п'яте ", " Двадцять шосте ",\
        " Двадцять сьоме ", " Двадцять восьме ", " Двадцять дев'яте ",\
        " Тридцяте ", " Тридцять перше "};
    cout << " ->";
    cout << dat[day-1] + mon[month-1];
}

int main() {
    SetConsoleOutputCP(CP_UTF8);

    int day, month;
    printf("Введіть день:");
    scanf("%d", &day);
    printf("Введіть місяць:");
    scanf("%d", &month);


    if(month < 1 || month > 12)
    {
        printf("\nВведено невірне значення місяця!");
        //system("pause");
        return 0;
    }

    if((month %2 == 1 && month <= 7 && month > 0)||(month %2 == 0 && month > 7 && month < 13))
    {
        if(day <= 31 && day > 0)
        {
            printf("\nВведено дату: %02d %02d", day, month);
            Translate(day, month);
        }
        else
            printf("\nВведено невірне значення дня! Такого дня немає в обраному місяці! У цьому місяці 31 день.");
    }
    else if((month %2 == 0 && month <= 6 && month > 3)||(month %2 == 1 && month > 8 && month < 12))
    {
        if(day <= 30 && day > 0)
        {
            printf("\nВведено дату: %02d %02d", day, month);
            Translate(day, month);
        }
        else
            printf("\nВведено неверное значенине дня! Такого дня немає в обраному місяці! У цьому місяці 30 днів.");
    }
    else
    {
        if(day <= 28 && day > 0)
        {
            printf("\nВведено дату: %02d %02d", day, month);
            Translate(day, month);
        }
        else
            printf("\nВведено невірное значення дня! Такого дня немає в обраному місяці! У лютому 28 днів.");
    }

    return 0;
}